<template>
  <div>
    <h1>背景介绍</h1>
    <p>摩捷出行c端产品的范围包括微信小程序、支付宝小程序、android端、ios端。</p>
    <p>
      各端产品的展示内容都一致，但每端的代码都需独立开发，相同逻辑的代码并没有共用起来，造成了开发成本、测试成本出现了巨大的浪费。
    </p>
    <p>本次重写小程序，主要目标是将相同内容用h5实现，以便各端内容都可共用代码，减少各方成本。</p>

    <h2>问题分析</h2>
    <p>1：开发：微信小程序 和 支付宝小程序 是两套代码，同一个功能，要写两遍。</p>
    <p>2：开发：目前使用的uniapp，开发时候，一次修改，编译时间要20+s，原生小程序仅需要三四秒。</p>
    <p>3：测试：相同的功能，在不同端都要进行测试，造成了测试成本过高。</p>
    <p>4：产品：需要实现一个页面能在多端同时运行，包括能够调用其相机的功能。方便跳转展示。</p>
    <p>5：重写后也会方便 业务逻辑改造及UI 的优化。只要涉及好UI，展示效果便能很快的焕然一新。</p>

    <h2>个人目标</h2>
    <p>1：增强小程序、小程序与h5混合开发的架构能力，开发能力。</p>
    <p>2：搭建移动端h5的相关基建，包括组件库、方法库、bridge桥接等。方便优化，减少开发成本。</p>
    <p>3：在重写的过程中，整理相关问题，归纳到前端规范中，减少后续的开发问题。</p>

    <h2>工作量统计</h2>
    <p>
      本次重写并不涉及到UI的改动。重写后，展示效果与原来基本一致，有点怀旧感。<br />
      所有重写的相关工作均独自完成。
    </p>
    <p>H5: 41个页面。</p>
    <p>微信小程序：12个页面。</p>
    <p>支付宝小程序：15个页面。</p>
  </div>
</template>

<script setup></script>

<style scoped></style>
